In [23]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
dataset = pd.read_csv("penguins.csv")

In [30]:
dataset.head()

,id,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [28]:
print(dataset.info)

<bound method DataFrame.info of       id    species     island  bill_length_mm  bill_depth_mm  \
0      0     Adelie  Torgersen            39.1           18.7
1      1     Adelie  Torgersen            39.5           17.4
2      2     Adelie  Torgersen            40.3           18.0
3      3     Adelie  Torgersen             NaN            NaN
4      4     Adelie  Torgersen            36.7           19.3
..   ...        ...        ...             ...            ...
339  339  Chinstrap      Dream            55.8           19.8
340  340  Chinstrap      Dream            43.5           18.1
341  341  Chinstrap      Dream            49.6           18.2
342  342  Chinstrap      Dream            50.8           19.0
343  343  Chinstrap      Dream            50.2           18.7

     flipper_length_mm  body_mass_g     sex  year
0                181.0       3750.0    male  2007
1                186.0       3800.0  female  2007
2                195.0       3250.0  female  2007
3                  NaN          NaN     NaN  2007
4                193.0       3450.0  female  2007
..                 ...          ...     ...   ...
339              207.0       4000.0    male  2009
340              202.0       3400.0  female  2009
341              193.0       3775.0    male  2009
342              210.0       4100.0    male  2009
343              198.0       3775.0  female  2009

[344 rows x 9 columns]>

In [32]:
print(dataset.info)

<bound method DataFrame.info of       id    species     island  bill_length_mm  bill_depth_mm  \
0      0     Adelie  Torgersen            39.1           18.7
1      1     Adelie  Torgersen            39.5           17.4
2      2     Adelie  Torgersen            40.3           18.0
3      3     Adelie  Torgersen             NaN            NaN
4      4     Adelie  Torgersen            36.7           19.3
..   ...        ...        ...             ...            ...
339  339  Chinstrap      Dream            55.8           19.8
340  340  Chinstrap      Dream            43.5           18.1
341  341  Chinstrap      Dream            49.6           18.2
342  342  Chinstrap      Dream            50.8           19.0
343  343  Chinstrap      Dream            50.2           18.7

     flipper_length_mm  body_mass_g     sex  year
0                181.0       3750.0    male  2007
1                186.0       3800.0  female  2007
2                195.0       3250.0  female  2007
3                  NaN          NaN     NaN  2007
4                193.0       3450.0  female  2007
..                 ...          ...     ...   ...
339              207.0       4000.0    male  2009
340              202.0       3400.0  female  2009
341              193.0       3775.0    male  2009
342              210.0       4100.0    male  2009
343              198.0       3775.0  female  2009

[344 rows x 9 columns]>

In [34]:
print(dataset.describe())

               id  bill_length_mm  bill_depth_mm  flipper_length_mm  \
count  344.000000      342.000000     342.000000         342.000000
mean   171.500000       43.921930      17.151170         200.915205
std     99.448479        5.459584       1.974793          14.061714
min      0.000000       32.100000      13.100000         172.000000
25%     85.750000       39.225000      15.600000         190.000000
50%    171.500000       44.450000      17.300000         197.000000
75%    257.250000       48.500000      18.700000         213.000000
max    343.000000       59.600000      21.500000         231.000000

       body_mass_g         year
count   342.000000   344.000000
mean   4201.754386  2008.029070
std     801.954536     0.818356
min    2700.000000  2007.000000
25%    3550.000000  2007.000000
50%    4050.000000  2008.000000
75%    4750.000000  2009.000000
max    6300.000000  2009.000000

In [42]:
data.shape

(344, 9)

In [44]:
data.nunique ()

id                   344
species                3
island                 3
bill_length_mm       164
bill_depth_mm         80
flipper_length_mm     55
body_mass_g           94
sex                    2
year                   3
dtype: int64

In [46]:
data.head()

,id,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [48]:
data.tail()

,id,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
339,339,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
340,340,Chinstrap,Dream,43.5,18.1,202.0,3400.0,female,2009
341,341,Chinstrap,Dream,49.6,18.2,193.0,3775.0,male,2009
342,342,Chinstrap,Dream,50.8,19.0,210.0,4100.0,male,2009
343,343,Chinstrap,Dream,50.2,18.7,198.0,3775.0,female,2009

In [38]:
dataset.columns

Index(['id', 'species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex', 'year'],
      dtype='object')

In [36]:
dataset.isna().sum()

id                    0
species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [40]:
dataset.duplicated().sum()

0